"""Все тексты для сообщений бота"""
from typing import Final

MESSAGE_TO_EDIT_NOT_FOUND_ERROR: Final[str] = "Ой, ошибочка вышла! Ожидай, наш верный программист все починит "\
                                              "(попробуй перезапустить бота -> /start)"
START_TALKING_MESSAGE: Final[str] = "че надо, давай рассказывай, сы-нок"
NOT_SUBSCRIBED_MESSAGE: Final[str] = "ЭЙ, СЫНОК!\nТы не подписан на все каналы!(\nНе расстраивай папу, подпишись!"
SUBSCRIBED_MESSAGE: Final[str] = "Ты подписан на все каналы, давай болтать!"
SETTINGS_MESSAGE: Final[str] = "НАСТРОЙКИ\nТы не можешь настроить папу, это же ИИ;)\nНо это наша собственная модель, "\
                               "и мы можем ее дообучать. Если есть идеи - высылай в предложку, возможно, они появятся "\
                               "в нашем папе!"
